In [3]:
import pandas as pd
from sqlalchemy import create_engine

In [7]:
usuario = 'postgres'
contraseña = 'postgre'
host = 'localhost'
puerto = '5432'
base_de_datos = 'postgres'

In [9]:
conexion = f'postgresql+psycopg2://{usuario}:{contraseña}@{host}:{puerto}/{base_de_datos}'

In [11]:
conn = create_engine(conexion)

In [13]:
conn

Engine(postgresql+psycopg2://postgres:***@localhost:5432/postgres)

In [15]:
try:
    version = pd.read_sql("SELECT version();", conn).iloc[0, 0]
    print("Conexión exitosa con SQLAlchemy.")
    print(f"Versión del servidor PostgreSQL: {version}")
except Exception as e:
    print(f"Ocurrió un error al conectar con SQLAlchemy: {e}")

Conexión exitosa con SQLAlchemy.
Versión del servidor PostgreSQL: PostgreSQL 17.5 on x86_64-windows, compiled by msvc-19.43.34808, 64-bit

In [18]:
consulta_1 = """
SELECT table_name
FROM information_schema.tables
WHERE table_schema = 'dw_tfm_restaurantes'
ORDER BY table_name;
"""
pd.read_sql(consulta_1, conn)

               table_name
0           aparcamientos
1              dim_barrio
2            dim_distrito
3          flujo_peatones
4               licencias
5    menu_restaurantes_mx
6        poblacion_madrid
7   residentes_demografia
8            restaurantes
9                terrazas
10     transporte_publico

In [20]:
consulta_2 = """
SELECT *
FROM 
  information_schema.columns 
WHERE 
  table_name = 'menu_restaurantes_mx';
"""
pd.read_sql(consulta_2, conn)

,table_catalog,table_schema,table_name,column_name,ordinal_position,column_default,is_nullable,data_type,character_maximum_length,character_octet_length,...,is_identity,identity_generation,identity_start,identity_increment,identity_maximum,identity_minimum,identity_cycle,is_generated,generation_expression,is_updatable
0,postgres,dw_tfm_restaurantes,menu_restaurantes_mx,id_plato,1,nextval('dw_tfm_restaurantes.menu_restaurantes...,NO,integer,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
1,postgres,dw_tfm_restaurantes,menu_restaurantes_mx,id_local,2,None,YES,bigint,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
2,postgres,dw_tfm_restaurantes,menu_restaurantes_mx,rotulo,3,None,YES,character varying,255.0,1.020000e+03,...,NO,None,None,None,None,None,NO,NEVER,None,YES
3,postgres,dw_tfm_restaurantes,menu_restaurantes_mx,platos,4,None,YES,text,NaN,1.073742e+09,...,NO,None,None,None,None,None,NO,NEVER,None,YES
4,postgres,dw_tfm_restaurantes,menu_restaurantes_mx,precio,5,None,YES,double precision,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
5,postgres,dw_tfm_restaurantes,menu_restaurantes_mx,estrellas,6,None,YES,double precision,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
6,postgres,dw_tfm_restaurantes,menu_restaurantes_mx,numero_opiniones,7,None,YES,integer,NaN,NaN,...,NO,None,None,None,None,None,NO,NEVER,None,YES
7,postgres,dw_tfm_restaurantes,menu_restaurantes_mx,calle,8,None,YES,character varying,255.0,1.020000e+03,...,NO,None,None,None,None,None,NO,NEVER,None,YES

In [22]:
consulta_3= """
SELECT 
  column_name, 
  data_type, 
  character_maximum_length, 
  is_nullable, 
  column_default 
FROM 
  information_schema.columns 
WHERE 
  table_name = 'menu_restaurantes_mx'
ORDER BY
    ordinal_position
"""

pd.read_sql(consulta_3, conn)

,column_name,data_type,character_maximum_length,is_nullable,column_default
0,id_plato,integer,NaN,NO,nextval('dw_tfm_restaurantes.menu_restaurantes...
1,id_local,bigint,NaN,YES,None
2,rotulo,character varying,255.0,YES,None
3,platos,text,NaN,YES,None
4,precio,double precision,NaN,YES,None
5,estrellas,double precision,NaN,YES,None
6,numero_opiniones,integer,NaN,YES,None
7,calle,character varying,255.0,YES,None

Leer fichero

In [24]:

df_rest_precios = pd.read_excel("./ficheros/B2_Menu_RestaurantesMX.xlsx")
df_rest_precios.head(10)

,id_local,rotulo,platos,precio,estrellas,numero_opiniones,calle
0,10000105,LA MORDIDA,Nachos con guacamole,16.9,4.4,2731,BELEN ...
1,10000105,LA MORDIDA,Flautas de pollo,8.9,4.4,2731,BELEN ...
2,10000105,LA MORDIDA,Chilaquiles verdes,14.9,4.4,2731,BELEN ...
3,10000105,LA MORDIDA,Jalapeños rellenos,9.9,4.4,2731,BELEN ...
4,10000105,LA MORDIDA,Pozole,9.9,4.4,2731,BELEN ...
5,10000105,LA MORDIDA,Quesadillas,9.9,4.4,2731,BELEN ...
6,10000105,LA MORDIDA,Enchiladas de pollo en salsa rojo,14.9,4.4,2731,BELEN ...
7,10000105,LA MORDIDA,Enchiladas de pollo con mole poblano,14.9,4.4,2731,BELEN ...
8,10000105,LA MORDIDA,4 tacos pastor,14.5,4.4,2731,BELEN ...
9,10000105,LA MORDIDA,4 tacos carnitas,13.5,4.4,2731,BELEN ...

In [26]:
df_rest_precios.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1534 entries, 0 to 1533
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_local          1534 non-null   int64
 1   rotulo            1534 non-null   object
 2   platos            1534 non-null   object
 3   precio            1534 non-null   float64
 4   estrellas         1534 non-null   float64
 5   numero_opiniones  1534 non-null   int64
 6   calle             1521 non-null   object
dtypes: float64(2), int64(2), object(3)
memory usage: 84.0+ KB

In [28]:
df_rest_precios.describe(include="all").T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
id_local,1534.0,NaN,NaN,NaN,233629354.326597,90974086.010944,10000105.0,270080421.0,270536971.0,280039701.0,290000158.0
rotulo,1534,42,TACO BELL,357,NaN,NaN,NaN,NaN,NaN,NaN,NaN
platos,1534,510,Michelada,36,NaN,NaN,NaN,NaN,NaN,NaN,NaN
precio,1534.0,NaN,NaN,NaN,9.14264,5.329168,1.0,4.5,8.6,12.9,33.5
estrellas,1534.0,NaN,NaN,NaN,4.255411,0.353244,3.5,4.0,4.3,4.5,4.9
numero_opiniones,1534.0,NaN,NaN,NaN,1833.290091,1868.136399,34.0,485.0,1185.5,2276.0,9788.0
calle,1521,72,FUENTES ...,59,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [30]:
df_rest_precios.isnull().sum()

id_local             0
rotulo               0
platos               0
precio               0
estrellas            0
numero_opiniones     0
calle               13
dtype: int64

Duplicados para eliminar

In [32]:
df_rest_precios.duplicated().values.any()

np.False_

Volcado Datos

In [44]:
df_rest_precios.to_sql('menu_restaurantes_mx', schema='dw_tfm_restaurantes', con = conn, if_exists = 'append', index=False)

534

In [46]:
count_db = pd.read_sql("SELECT COUNT(*) AS count FROM dw_tfm_restaurantes.menu_restaurantes_mx", conn).iloc[0, 0]
count_df = len(df_rest_precios)

print(f"Filas en DataFrame: {count_df}")
print(f"Filas en tabla dw_tfm_restaurantes: {count_db}")

if count_df == count_db:
    print("La carga se efectuó correctamente.")
else:
    print("Hay discrepancias en la cantidad de filas insertadas.")

Filas en DataFrame: 1534
Filas en tabla dw_tfm_restaurantes: 1534
La carga se efectuó correctamente.